1
 
本
语
言
是
一
门
同
时
支
持
面
向
过
程
和
面
向
对
象
编
程
范
式
的
编
译
型
通
用
高
级
编
程
语
言

2 标识符
标识符是具有命名作用的字符序列
标识符由字母（区分大小写）、数字、下划线构成，其中第一个字符不能是数字
编译器预先定义关键字，自定义标识符不能与关键字冲突
编译器预先定义保留字，自定义标识符能与保留字冲突

3 类型
类型告诉编译器如何解析和处理数据
绝对类型由类型前缀（可选可叠加）、类型根、类型后缀（可选可叠加）三部分构成
相对类型由类型（可选可叠加）前缀、类型根构成
类型前缀和类型根都是关键字
类型前缀包括：
short 把后面的相对类型分配的空间除以2（仅对int型及变种、float型及变种、char型及变种生效）
long 把后面的相对类型分配的空间乘2（仅对int型及变种、float型及变种、char型及变种生效）
unsigned 把后面的类型变成无符号类型（仅对int型及变种生效）
decimal 把后面的类型变成十进制（仅对float型及变种生效）
const 把后面的类型变成不可变类型（无则默认可变）
类型根包括：
int 整数数型（简称整型），有符号32位，变种最多128位，最少8位
float IEEE754浮点数数型（简称浮点型），二进制64位，变种最多128位，最少二进制16位，十进制32位
char Unicode字符型（简称字符型），16位，变种最多32位，最少8位
bool 布尔逻辑型（简称布尔型），8位
void 无型，0位（不分配内存）
类型后缀包括：
$ 形成前面绝对类型的值类型（一般可省略）
* 形成前面绝对类型的址类型（指针）
[] 形成前面绝对类型的组类型（数组，[]里面加整型字面量可以限定长度）
& 形成前面绝对类型的引用，为编译期元类型

4 字面量
编译器把字面量转换成相关类型的数据代入可执行文件
整型字面量由符号（省略表正、-表负）、进制（省略表十进制、0b表二进制、0o表八进制、0x表16进制）、数值（按各自进制规则拼，十六进制用大写A到F）、后缀（省略表有符号32位，U表无符号32位、L表有符号64位、UL表无符号64位、LL表有符号128位、ULL表无符号128位）
小数形式浮点字面量由整数部分（整型字面量，为0时可省略）、小数点（.）、小数部分（按十进制规则拼，为0时可省略）、后缀（省略表双精度二进制、H表半精度二进制、F表单精度二进制、L表长双精度二进制、DF表单精度十进制、D表双精度十进制、DL表长双精度十进制）
