本语言是一门同时支持面向过程和面向对象编程范式的通用高级编程语言。

注释是编译器忽略的代码部分，以``括起

标识符编译器，以0 1 2 3 4 5 6 7 8 9 A B C D E F G H I J K L M N O P Q R S T U V W X Y Z _ a b c d e f g h i j k l m n o p q r s t u v w x y z组成的任意长度字符序列，必须以非0 1 2 3 4 5 6 7 8 9开头

语句是编译器顺序编译的语法单元，本质为标识符、语法符、运算符的组合，以;结尾

块是编译器结构编译的语法单元，本质为语句的组合，以{}括起

5 字面量
5.1 布尔型字面量
5.1.1 任何非零非无非空字面量为布尔真，否则为布尔假
5.1.2 true表示布尔真，false表示布尔假
5.4 浮点数型字面量
5.4.1 小数形式[待补]
5.4.2 指数形式[待补]
5.4.3 原值形式[待补]
5.4.3 浮点数型字面量精度与进制限定后缀（缺省：双精度二进制）
f 单精度二进制
h 半精度二进制
ld 长双精度二进制
d 双精度十进制
df 单精度十进制
5.3 字符型字面量
5.3.1 [待补]
5.3.2 字符转义
转义 含义
\" 即"
\' 即'
\\ 即\
\a 响铃（BEL）
\b 退格（BS）
\f 换页符（FF）
\n 换行符（LF或NL）
\r 回车符（CR）
\t 水平制表符（HT或TAB）
\v 垂直制表符（VT）
5.4 整型字面量
5.4.1 十进制形式[待补]
5.4.2 二进制形式[待补]
5.4.3 八进制形式[待补]
5.4.4 十六进制形式[待补]
5.4.5 整型字面量符号与宽度限定后缀（缺省：有符号32位）
s 有符号16位
us 无符号16位
ss 有符号8 位
uss 无符号8 位
u 无符号32位
l 有符号64位
ul 无符号64位
ll 有符号128 位
ull 无符号128 位
5.5 无型字面量
5.5.1 none表示无
5.6 址型字面量
5.6.1 [待补]
5.6.2 null表示空
5.7 组型字面量
5.7.1 [待补]
5.8 字符组（字符串）字面量
5.8.1 [待补]
5.8.2 字符转义同5.3.2条

6 类型
  6.1 基本类型
bool 布尔型（缺省：值）
char 字符型（缺省：16位值）
float 浮点数型（缺省：双精度二进制值）
int 整型（缺省：有符号32位值）
void 无型（缺省：值）
  6.2 类型修饰
    6.2.1 类型修饰前缀
const 不可变
decimal 十进制
long 位宽增倍
short 位宽减半
unsigned 无符号
    6.2.2 类型修饰后缀
* 址
[（可选）长度] 组
& 引用
  6.3 复合类型

  6.4 结构体类型
[待补]
