本语言是一门同时支持面向过程和面向对象编程范式的通用高级编程语言

1 注释
1.1 注释从` 开始，到` 或文件尾结束

2 标识符
2.1 标识符由以下构成
0 1 2 3 4 5 6 7 8 9
A B C D E F G H I J K L M
N O P Q R S T U V W X Y Z
_
a b c d e f g h i j k l m
n o p q r s t u v w x y z
2.2 标识符不能由以下任一起始
0 1 2 3 4 5 6 7 8 9

3 语句
3.1 语句从首个有效记号开始，到“;” 或块尾或文件尾结束
3.2 语句不可嵌套

4 块
4.1 块从{ 开始，到} 或文件尾结束
4.2 块不可嵌套

5 字面量
5.1 布尔型字面量
5.1.1 任何非零非无非空字面量为布尔真，否则为布尔假
5.1.2 true表示布尔真，false 表示布尔假
5.4 浮点数型字面量
5.4.1 小数形式[ 待补 ]
5.4.2 指数形式[ 待补 ]
5.4.3 原值形式[ 待补 ]
5.4.3 浮点数型字面量精度与进制限定后缀
缺省  双精度二进制
f 单精度二进制
h 或hf  半精度二进制
l 或ld  长双精度二进制
dd  双精度十进制
df  单精度十进制
5.3 字符型字面量
5.3.1 [ 待补 ]
5.3.2 字符转义
转义 含义
\" 即"
\' 即'
\\ 即\
\a 响铃（BEL ）
\b 退格（BS）
\f 换页符（FF）
\n 换行符（LF或NL）
\r 回车符（CR）
\t 水平制表符（HT或TAB ）
\v 垂直制表符（VT）
5.4 整型字面量
5.4.1 十进制形式[ 待补 ]
5.4.2 二进制形式[ 待补 ]
5.4.3 八进制形式[ 待补 ]
5.4.4 十六进制形式[ 待补 ]
5.4.5 整型字面量符号与宽度限定后缀
缺省  有符号32位
s 有符号16位
us  无符号16位
ss  有符号8 位
uss 无符号8 位
u 无符号32位
l 有符号64位
ul  无符号64位
ll  有符号128 位
ull 无符号128 位
5.5 无型字面量
5.5.1 none表示无
5.6 址型字面量
5.6.1 [ 待补 ]
5.6.2 null表示空
5.7 组型字面量
5.7.1 [ 待补 ]
5.8 字符数组（字符串）字面量
5.8.1 [ 待补 ]
5.8.2 字符转义同5.3.2

6 类型
6.1 基本类型
bool  布尔型
char  字符型
float 浮点数型
int 整型
void  无型
6.2 类型修饰
6.2.1 类型修饰前缀

6.2.2 类型修饰前缀

6.3 复合类型

6.4 结构体类型
[ 待补 ]
