1
 
本
语
言
是
一
门
同
时
支
持
面
向
过
程
和
面
向
对
象
编
程
范
式
的
编
译
型
通
用
高
级
编
程
语
言

2 标识符
标识符是具有命名作用的字符序列
标识符由字母（区分大小写）、数字、下划线构成，其中第一个字符不能是数字
编译器预先定义关键字，自定义标识符不能与关键字冲突
编译器预先定义保留字，自定义标识符能与保留字冲突

3 类型
类型告诉编译器如何解析和处理数据
绝对类型由类型前缀（可选可叠加）、类型根、类型后缀（可选可叠加）三部分构成
相对类型由类型（可选可叠加）前缀、类型根构成
类型前缀和类型根都是关键字
类型前缀包括：
short 把后面的相对类型分配的空间除以2（仅对int型及变种、float型及变种、char型及变种生效）
long 把后面的相对类型分配的空间乘2（仅对int型及变种、float型及变种、char型及变种生效）
unsigned 把后面的类型变成无符号类型（仅对int型及变种生效）
decimal 把后面的类型变成十进制（仅对float型及变种生效）
const 把后面的类型变成不可变类型
类型根包括：
int 整数数型（简称整型），有符号32位，变种最多128位，最少8位
float IEEE754浮点数数型（简称浮点型），二进制64位，变种最多128位，最少二进制16位，十进制32位
char Unicode字符型（简称字符型），16位，变种最多32位，最少8位
bool 布尔逻辑型（简称布尔型），8位
void 无型，0位（不分配内存）
类型后缀包括：
$ 形成前面绝对类型的值类型（一般可省略）
* 形成前面绝对类型的址类型（指针）
[] 形成前面绝对类型的组类型（数组，[]里面加整型字面量可以限定长度）
& 形成前面绝对类型的引用，为编译期元类型
