1
 
本
语
言
是
一
门
同
时
支
持
面
向
过
程
和
面
向
对
象
编
程
范
式
的
编
译
型
通
用
高
级
编
程
语
言

2 标识符
标识符是具有命名作用的字符序列
标识符由字母（区分大小写）、数字、下划线构成，其中第一个字符不能是数字
编译器预先定义关键字，自定义标识符不能与关键字冲突
编译器预先定义保留字，自定义标识符能与保留字冲突

3 类型
类型告诉编译器如何解析和处理数据
绝对类型由类型前缀（可选可叠加）、类型根、类型后缀（可选可叠加）三部分构成
相对类型由类型（可选可叠加）前缀、类型根构成
类型前缀和类型根都是关键字
类型前缀包括：
short 把后面的相对类型分配的空间除以2（仅对int型及变种、float型及变种、char型及变种生效）
long 把后面的相对类型分配的空间乘2（仅对int型及变种、float型及变种、char型及变种生效，long char为24位，long long char为32位）
unsigned 把后面的类型变成无符号类型（仅对int型及变种生效）
decimal 把后面的类型变成十进制（仅对float型及变种生效）
const 把后面的类型变成不可变类型（无则默认可变）
类型根包括：
int 整数数型（简称整型），有符号32位，变种最多128位，最少8位
float IEEE754浮点数数型（简称浮点型），二进制64位，变种最多128位，最少二进制16位，十进制32位
char Unicode字符型（简称字符型），16位，变种最多32位，最少8位
bool 布尔逻辑型（简称布尔型），8位
void 无型，0位（不分配内存）
类型后缀包括：
$ 形成前面绝对类型的值类型（一般可省略）
* 形成前面绝对类型的址类型（指针）
[] 形成前面绝对类型的组类型（数组，[]里面加整型字面量可以限定长度）
这是真数组，不会退化成指针
& 形成前面绝对类型的引用，为编译期元类型
结构体由struct[]括起，,隔开各个元素
string，本质上是struct[void*, length]

4 字面量
编译器把字面量转换成相关类型的数据代入可执行文件
整字面量由符号（省略表正、-表负）、进制（省略表十进制、0b表二进制、0o表八进制、0x表16进制）、数值（按各自进制规则拼，十六进制用大写A到F）、后缀（省略表二进制双精度、H 表二进制半精度、F 表二进制单精度、L 表二进制长双精度、DF 表十进制单精度、D 表十进制双精度、DL 表十进制长双精度）构成
小数形式浮点字面量由整数部分（整型字面量，为0时可省略）、小数点（.）、小数部分（按十进制规则拼，为0时可省略）、后缀（省略表双精度二进制、H表半精度二进制、F表单精度二进制、L表长双精度二进制、DF表单精度十进制、D表双精度十进制、DL表长双精度十进制）构成
指数形式浮点字面量由小数形式浮点字面量（大于等于1且小于10）、e、整型字面量构成
原值形式浮点字面量由进制（0f表二进制、0d表十进制）、数值（按十六进制规则拼，用大写A到F）构成
字符字面量用''括起，里面一个字符或一个转义字符
字符串字面量用""括起，里面零个或一个或多个字符或转义字符
布尔字面量有true表真，false表假
无字面量有none表无
址字面量由0a、数值（按十六进制规则拼，用大写A到F）构成，null表空
组字面量用[]括起，,隔开各个元素

5 变量
编译器追踪变量，掌管自动存储期内存分配与释放，管理作用域
变量在声明时分配内存，每个位的初始值都为0
变量声明格式是类型 标识符
uncertain 变量名声明变量是无确切值的
引用类型 标识符 = 变量名声明引用

6 自由存储区内存分配与释放
new 类型在自由存储区分配一块恰好容纳此类型的内存，需要一个指针接受
del 指针释放指针指向的自由存储区

7 函数
函数声明格式是返回值类型 标识符(形参列，,隔开表) {函数体}
函数的形参是实参的引用
在每个形参的前面加上一个<>里面装一个标识符，这样一来就可以用这个标识符表示这个形参的类型，也可以不要形参名，传实参时就直接用类型名
形参名后面加[标识符]声明这是可变参数，当做数组用，那个标识符是传递形参时自动传进去的数组长度
形参后面直接用=赋值提供默认值
如果函数返回值不是void型或不是main函数，必须用这个格式return 值返回值，void可以仅return不带值
调用格式函数名(实参列表，,隔开)

8 运算符与表达式
表达式为运算符加操作数，操作数可以是函数调用、变量、字面量、表达式
()括起可以增加优先级，编译器依据运算符优先级和结合性自动添加()
constexpr 可以让之后的表达式在编译期求值并代入，但是其中的所有操作数必须都是确切的

附录A 关键字
bool
char
const
decimal
del
float
int
long
new
return
short
string
struct
uncertain
unsigned
void

附录B 保留字
false
none
null
true

附录C 转义序列
\a 响铃（BEL）
\b 退格（BS）
\f 换页（FF）
\n 换行（LF/NL）
\r 回车（CR）
\t 水平制表符（HT/TAB）
\v 垂直制表符（VT）
\" 即"
\' 即'
\\ 即\
\uhh 单字节Unicode字符
\unhhhh 双字节Unicode字符
\unihhhhhh 三字节Unicode字符
\uniohhhhhhhh 四字节Unicode字符

附录D 运算符
[] 取索引，内结合、左结合
-取负、*解引用、&取指针、wid@取位宽、len@取长、!取非、~取反，右结合
*乘、/除、%取模，左结合
+加、-减，左结合
&按位与、|按位或、^按位异或、~&按位与非、~|按位或非、~^按位同或、>>逻辑右移、>>>算术右移、<<逻辑左移、<<<算术左移，左结合
==等于、!=不等于、<小于、<=小于等于、>大于、>=大于等于，禁结合
&&逻辑与、||逻辑或、^^逻辑异或、!&&逻辑与非、!||逻辑或非、!^^逻辑同或，串联结合
=赋值，右结合
